app/controllers/headaches_controller.rb

SELECT * FROM "headaches"
---
  def index
    @headaches = Headach.all

SELECT * FROM "headaches" WHERE ("headaches"."id" = 1)
---
  def show
    @headach = Headach.find(params[:id])

SELECT * FROM "headaches" WHERE ("headaches"."id" = 1)
---
  def edit
    @headach = Headach.find(params[:id])

INSERT INTO "headaches" ("duration", "created_at", "notes", "updated_at", "initial_severity", "max_severity", "start_time") VALUES(0, '2010-04-21 06:39:51', 'asdf', '2010-04-21 06:39:51', 'adsf', 'adsf', 0)
---
  def create
    @headach = Headach.new(params[:headach])

    respond_to do |format|
      if @headach.save