app/controllers/patients_controller.rb

SELECT * FROM "patients" LIMIT 30 OFFSET 0
---
  def index
    @patients = Patient.paginate(:page => params[:page])

SELECT * FROM "patients" WHERE ("patients"."id" = 1)
---
  def show
    @patient = Patient.find(params[:id])

SELECT * FROM "patients" WHERE ("patients"."id" = 4)
---
  def edit
    @patient = Patient.find(params[:id])

INSERT INTO "patients" ("name", "encrypted_password", "salt", "created_at", "updated_at", "admin", "remember_token", "email") VALUES('hellothere1', '231938ea555782527a9f07354728603897ef109700be9c33aa9cfbd33b484bd0', '74a14772937be97fb4da2e1557c0ddd0b823d83a211c54ddc8ea81ff264732c3', '2010-05-04 10:43:22', '2010-05-04 10:43:22', NULL, NULL, 'sofun@fun.com')
---
  def create
    @patient = Patient.new(params[:patient])

    respond_to do |format|
      if @patient.save

SELECT * FROM "patients" WHERE ("patients"."id" = 4)
UPDATE "patients" SET "updated_at" = '2010-05-04 02:53:14', "email" = 'hello@fuckaaaaaayou.com', "encrypted_password" = '6549f0885bc643d4baf0b103939a9bfc44d7c5338c26f0e4935c9493c7702d14', "salt" = '7d630789b2da0bf8d221e48058e68bbf3a2301f5c738f1130ebe3030b5af7270' WHERE "id" = 4
---
  def update
    @patient = Patient.find(params[:id])

    respond_to do |format|
      if @patient.update_attributes(params[:patient])